var dom = document.getElementById("container");
var myChart = echarts.init(dom.getElementById);
var app = {};

var option = {
    title: {
        text: '计划生育手术情况'
    },
    tooltip: {
        trigger: 'axis',
        axisPointer: {
            type: 'cross',
            label: {
                backgroundColor: '#6a7985'
            }
        }
    },
    legend: {
        data: ['放置节育器', '取出节育器', '输精管结扎', '输卵管结扎', '人工流产']
    },
    toolbox: {
        feature: {
            saveAsImage: {}
        }
    },
    grid: {
        left: '3%',
        right: '4%',
        bottom: '3%',
        containLabel: true
    },
    xAxis: [
        {
            type: 'category',
            boundaryGap: false,
            data: ['1980', '1981', '1982', '1983', '1984', '1985', '1986','1987','1988','1989','1990',
                '1991','1992','1993','1994','1995','1996','1997','1998','1999','2000','2001','2002','2003'
                ,'2004','2005','2006','2007','2008','2009','2010','2011','2012','2013','2014','2015','2016','2017','2018']
        }
    ],
    yAxis: [
        {
            type: 'value'
        }
    ],
    series: [
        {
            name: '放置节育器',
            type: 'line',
            stack: '总量',
            areaStyle: {},
            emphasis: {
                focus: 'series'
            },
            data: [40.1,45.4,41.7,30.5,37.0,37.3,37.4,38.9,38.4,37.4,35.3,32.2,36.0,37.3,37.0,37.6,38.4,38.9,39.4,
                39.3,38.6,38.8,37.0,36.5,36.0,35.1,36.6,36.8,33.4,34.3,34.0,33.2,33.1,33.5,35.1,34.6,25.3,24.4,20.5]
        },
        {
            name: '输精管结扎',
            type: 'line',
            stack: '总量',
            areaStyle: {},
            emphasis: {
                focus: 'series'
            },
            data: [4.8,2.9,3.7,7.3,4.1,2.2,3.6,5.1,3.3,5.2,4.2,6.2,3.1,2.6,2.4,2.1,2.4,2.1,1.7,1.8,1.8,1.5,1.2,1.5,1.0,1.0,
                1.4,1.1,0.9,1.0,1.0,0.9,0.8,0.8,0.7,0.6,0.2,0.1,0.3]
        },
        {
            name: '输卵管结扎',
            type: 'line',
            stack: '总量',
            areaStyle: {},
            emphasis: {
                focus: 'series'
            },
            data: [13.4,6.8,11.6,28.2,17.1,8.9,10.2,12.7,11.3,14.5,15.2,17.7,16.1,14.3,13.3,10.4,11.9,11.5,10.2,10.0,
                9.5,9.1,7.8,7.9,7.9,7.3,7.5,8.0,7.0,7.8,7.7,7.3,7.2,6.7,6.1,5.2,2.3,2.1,2.2]
        },
        {
            name: '人工流产',
            type: 'line',
            stack: '总量',

            areaStyle: {},
            emphasis: {
                focus: 'series'
            },
            data: [33.3,38.2,36.9,24.7,28.0,42.6,40.7,30.3,39.8,35.8,38.6,36.9,37.2,37.8,33.9,33.6,38.5,32.3,37.9,
                37.1,37.6,36.8,38.6,38.8,38.5,36.7,38.4,38.8,40.0,26.8,28.7,30.2,30.7,30.7,39.8,41.4,45.9,50.6,52.9]
        },
        {
            name: '取出节育器',
            type: 'line',
            stack: '总量',

            areaStyle: {},
            emphasis: {
                focus: 'series'
            },
            data: [8.4,6.6,6.1,9.1,13.8,8.9,8.1,7.0,7.1,7.1,6.7,6.9,7.7,8.1,8.3,8.3,8.8,9.2,10.7,11.7,12.6,13.8,13.6,
                14.0,15.2,14.4,14.7,14.2,12.8,13.6,12.7,12.8,13.0,13.7,14.6,14.8,22.5,20.7,18.9]
        }
    ]
};


if (option && typeof option === 'object') {
    myChart.setOption(option);
}

myChart.setOption(option);

window.onresize=function () {
    myChart.resize()
}
